<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>Healthcare Analytics - Healthcare Analytics Graph Examples</title>
    <link rel="canonical" href="https://neo4j.com/neo4j-graph-examples-healthcare-analytics/1/healthcare-analytics/">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../assets/css/site.css">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Public+Sans:wght@300;400;500;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Developer Guide">
    <meta property="neo:site" content="Developer Site">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="Healthcare Analytics - Healthcare Analytics Graph Examples" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content="Healthcare Analytics - Healthcare Analytics Graph Examples" />
    <meta property="og:url" content="https://neo4j.com/neo4j-graph-examples-healthcare-analytics/1/healthcare-analytics/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article developer">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="_/img/Logo_White_RGB_TransBG.svg" alt="" />
      <a href="/developer/" class="navbar-item no-left-padding page-name-white" aria-label="Developer Guides">
        Developer
      </a>
      
      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
                <li><a href="/docs/cdc/current/" class="project-link">Change Data Capture (CDC)</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="neo4j-graph-examples-healthcare-analytics" data-version="1">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
              <div class="feedback" style="height: var(--feedback-height);">
    <div class="header question">
        <p><strong>Is this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
</nav>
        <div class="edit-this-page"><a href="https://github.com/QubitPi/neo4j-graph-examples-healthcare-analytics/tree/master/modules/ROOT/pages/healthcare-analytics.adoc">Edit this Page</a></div>
    </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
<h1 class="page">Healthcare Analytics</h1>
</div>





<div class="sect1">
<h2 id="_healthcare_analytics_load_and_analyse_fda_adverse_event_reporting_system_data_with_neo4j"><a class="anchor" href="#_healthcare_analytics_load_and_analyse_fda_adverse_event_reporting_system_data_with_neo4j"></a>Healthcare Analytics - Load and analyse FDA Adverse Event Reporting System Data with Neo4j</h2>
<div class="sectionbody">
<div class="imageblock right">
<div class="content">
<img src="../_images/healthcare-analytics.jpg" alt="healthcare analytics" width="300px">
</div>
</div>
<div class="paragraph">
<p>Health care analytics is the analysis activities that can be undertaken as a result of data collected from four areas within healthcare:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>claims and cost data,</p>
</li>
<li>
<p>pharmaceutical and research and development (R&amp;D) data,</p>
</li>
<li>
<p>clinical data (collected from electronic medical records (EHRs)),</p>
</li>
<li>
<p>and patient behavior and sentiment data (patient behaviors and preferences, (retail purchases e.g. data captured in running stores).</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Health care analytics is a growing industry, expected to grow to even more with time.</p>
</div>
<div class="paragraph">
<p>Health care analytics allows for the examination of patterns in various healthcare data to determine how clinical care can be improved while limiting excessive spending.
This can help improve the overall patient care offered in healthcare facilities.</p>
</div>
<div class="paragraph">
<p>Healthcare organizations can <em>"realize new opportunities and efficiencies by leveraging the connections within their existing data: be it in a connected genome, or a provider network, or patient treatments,"</em> said Emil Eifrem, CEO of Neo4j, in one of his statements statement summarizing the graph database company&#8217;s traction in the healthcare space.
There are many companies in the market who are leveraging the potential of Neo4j Graph Database to unleash the hidden potential of the healthcare data.</p>
</div>
<div class="paragraph">
<p>The connected data capabilities of a graph database can help us achieve what is either impossible or complicated with the traditional relational databases, other NoSQL databases or even big data solutions like Pig and Hive.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_demo_use_case"><a class="anchor" href="#_demo_use_case"></a>Demo Use Case</h2>
<div class="sectionbody">
<div class="imageblock right">
<div class="content">
<img src="../_images/fda.jpg" alt="fda">
</div>
</div>
<div class="paragraph">
<p>This demonstration guide covers a similar case of healthcare data analysis with Neo4j.</p>
</div>
<div class="paragraph">
<p>We are performing data ingestion and analytics of the FDA Adverse Event Reporting System Data.
The FDA Adverse Event Reporting System (FAERS or AERS) is a computerized information database designed to support the U.S. Food and Drug Administration&#8217;s (FDA) post marketing safety surveillance program for all approved drug and therapeutic biologic products.</p>
</div>
<div class="paragraph">
<p>The FDA uses FAERS to monitor for new adverse events and medication errors that might occur with these products.
It is a system that measures occasional harms from medications to ascertain whether the risk–benefit ratio is high enough to justify continued use of any drug and to identify correctable and preventable problems in health care delivery (such as need for retraining to prevent prescribing errors).</p>
</div>
<div class="paragraph">
<p>Reporting of adverse events from the point of care is voluntary in the United States.
The FDA receives some adverse event and medication error reports directly from health care professionals (such as physicians, pharmacists, nurses, and others) and consumers (such as patients, family members, lawyers, and others).
Health professionals and consumers may also report these events to the products’ manufacturers.
If a manufacturer receives an adverse event report, they are required to send the report to the FDA as specified by regulations.</p>
</div>
<div class="paragraph">
<p>We downloaded one of the <a href="https://www.fda.gov/drugs/questions-and-answers-fdas-adverse-event-reporting-system-faers/fda-adverse-event-reporting-system-faers-public-dashboard" target="_blank" rel="noopener">FDA FAERS datasets</a>, massaged and articulated the demographics for United States.
We performed data ingestion to prepare the FAERS graph and run a few example analytics queries to see interesting output.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_data_model"><a class="anchor" href="#_data_model"></a>Data Model</h2>
<div class="sectionbody">
<div class="imageblock">
<div class="content">
<img src="../_images/model.svg" alt="model" width="100%">
</div>
</div>
<div class="sect2">
<h3 id="_faers_entities_graph_nodes_explained"><a class="anchor" href="#_faers_entities_graph_nodes_explained"></a>FAERS Entities : Graph Nodes Explained</h3>
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 10%;">
<col style="width: 10%;">
<col style="width: 80%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Entity</th>
<th class="tableblock halign-left valign-top">Label</th>
<th class="tableblock halign-left valign-top">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Demographic</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Case</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>This is the demographic information of a person involved in the adverse event report.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Drug</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Drug</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Drug involved in the adverse event. A drug can be a primary suspect, secondary suspect, concomitant or interacting drug responsible for the adverse effect. This suspect type is identified by the relationship between Case and Drug Nodes.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Reaction</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Reaction</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>This is the reaction that the person (Case) developed after consumption of the respective drug, like 'Pain', 'Body temperature increased' or 'Insomnia' or 'Memory Loss' etc.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Outcome</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Outcome</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>This is the long term outcome of the case after the adverse event, for example 'Hospitalization: Initial or Prolonged', 'Disability' or 'Death'</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Report_Source</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>ReportSource</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>This is the reported of the adverse event, for example 'Health Professional', 'Consumer', 'User Health Facility' etc who has reported the event to FDA system.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Therapy</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Therapy</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>For some cases, they receive drug as a part of a therapy. This is the therapy details for the case.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Indication</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>-</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>This is the medical term for drug indication that has the details like drug sequence, indication point. We have not used a separate Node label for this, instead we have covered required details as <code>Case</code> to <code>Drug</code> relationship properties.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Demographics</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>AgeGroup</code></p></td>
<td class="tableblock halign-left valign-top"><div class="content"><div class="paragraph">
<p>Demographics table in the FEARS data has age information that we turned into a separate node for Age Group reporting.</p>
</div></div></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_preparing_the_schema"><a class="anchor" href="#_preparing_the_schema"></a>Preparing the schema</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Create constraints and indexes to prepare the schema (or model) for the graph</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// Constraints
CREATE CONSTRAINT constraint_drug_name IF NOT EXISTS FOR (n: `Drug`) REQUIRE n.`name` IS UNIQUE;
CREATE CONSTRAINT constraint_case_primaryid IF NOT EXISTS FOR (n: `Case`) REQUIRE n.`primaryid` IS UNIQUE;
CREATE CONSTRAINT constraint_reaction_description IF NOT EXISTS FOR (n: `Reaction`) REQUIRE n.`description` IS UNIQUE;
CREATE CONSTRAINT constraint_reportsource_code IF NOT EXISTS FOR (n: `ReportSource`) REQUIRE n.`code` IS UNIQUE;
CREATE CONSTRAINT constraint_outcome_code IF NOT EXISTS FOR (n: `Outcome`) REQUIRE n.`code` IS UNIQUE;
CREATE CONSTRAINT constraint_therapy_primaryid IF NOT EXISTS FOR (n: `Therapy`) REQUIRE n.`primaryid` IS UNIQUE;
CREATE CONSTRAINT constraint_manufacturer_name IF NOT EXISTS FOR (n: `Manufacturer`) REQUIRE n.`manufacturerName` IS UNIQUE;

// indexes
CREATE INDEX index_case_age IF NOT EXISTS FOR (n: `Case`) ON (n.`age`);
CREATE INDEX index_case_ageUnit IF NOT EXISTS FOR (n: `Case`) ON (n.`ageUnit`);
CREATE INDEX index_case_gender IF NOT EXISTS FOR (n: `Case`) ON (n.`gender`);
CREATE INDEX index_case_eventdate IF NOT EXISTS FOR (n: `Case`) ON (n.`eventDate`);
CREATE INDEX index_case_reportdate IF NOT EXISTS FOR (n: `Case`) ON (n.`reportDate`);</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_load_cases_manufacturers_and_relate_them"><a class="anchor" href="#_load_cases_manufacturers_and_relate_them"></a>Load cases, manufacturers and relate them</h2>
<div class="sectionbody">
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">LOAD CSV WITH HEADERS FROM "https://raw.githubusercontent.com/neo4j-graph-examples/healthcare-analytics/main/data/csv/demographics.csv" AS row

//Conditionally create Case nodes, set properties on first create
MERGE (c:Case { primaryid: toInteger(row.primaryid) })
ON CREATE SET
c.eventDate= date(row.eventDate),
c.reportDate= date(row.reportDate),
c.age = toFloat(row.age),
c.ageUnit = row.ageUnit,
c.gender = row.sex,
c.reporterOccupation = row.reporterOccupation

//Conditionally create Manufacturer
MERGE (m:Manufacturer { manufacturerName: row.manufacturerName } )

//Relate case and manufacturer
MERGE (m)-[:REGISTERED]-&gt;(c)

//Conditionally create age group node and relate with case
MERGE (a:AgeGroup { ageGroup: row.ageGroup })

//Relate case with age group
MERGE (c)-[:FALLS_UNDER]-&gt;(a)

RETURN count (c);</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_load_other_information_related_to_the_events"><a class="anchor" href="#_load_other_information_related_to_the_events"></a>Load other information related to the events</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_load_outcomes_and_link_them_with_cases"><a class="anchor" href="#_load_outcomes_and_link_them_with_cases"></a>Load outcomes and link them with cases</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">LOAD CSV WITH HEADERS FROM "https://raw.githubusercontent.com/neo4j-graph-examples/healthcare-analytics/main/data/csv/outcome.csv" AS row

// Conditionally create outcome node
MERGE (o:Outcome { code: row.code })
ON CREATE SET
o.outcome = row.outcome

WITH o, row

// Find the case to relate this outcome to
MATCH (c:Case {primaryid: toInteger(row.primaryid)})

// Relate
MERGE (c)-[:RESULTED_IN]-&gt;(o)

RETURN count(o);</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_load_reactions_and_link_them_with_cases"><a class="anchor" href="#_load_reactions_and_link_them_with_cases"></a>Load reactions and link them with cases</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">LOAD CSV WITH HEADERS FROM "https://raw.githubusercontent.com/neo4j-graph-examples/healthcare-analytics/main/data/csv/reaction.csv" AS row

//Conditionally create reaction node
MERGE (r:Reaction { description: row.description })

WITH r, row

//Find the case to relate this reaction to
MATCH (c:Case {primaryid: toInteger(row.primaryid)})

//Relate
MERGE (c)-[:HAS_REACTION]-&gt;(r)

RETURN count(r);</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_load_report_sources_and_link_them_with_cases"><a class="anchor" href="#_load_report_sources_and_link_them_with_cases"></a>Load report sources and link them with cases</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">LOAD CSV WITH HEADERS FROM "https://raw.githubusercontent.com/neo4j-graph-examples/healthcare-analytics/main/data/csv/reportSources.csv" AS row

// Conditionally create reportSource node
MERGE (r:ReportSource { code: row.code })
ON CREATE SET
r.name = row.name

WITH r, row

// Find the case to relate this report source to
MATCH (c:Case {primaryid: toInteger(row.primaryid) })

WITH c, r

// Relate
MERGE (c)-[:REPORTED_BY]-&gt;(r)

RETURN count(r);</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_load_drugs_and_therapies"><a class="anchor" href="#_load_drugs_and_therapies"></a>Load drugs and therapies</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_load_drugs_with_indications_and_link_them_with_cases_using_relationships_based_on_their_roles_for_the_cases"><a class="anchor" href="#_load_drugs_with_indications_and_link_them_with_cases_using_relationships_based_on_their_roles_for_the_cases"></a>Load drugs with indications and link them with cases using relationships based on their roles for the cases</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">:auto LOAD CSV WITH HEADERS FROM "https://raw.githubusercontent.com/neo4j-graph-examples/healthcare-analytics/main/data/csv/drugs-indication.csv" AS row

CALL { WITH row
//Conditionally create Drug node
MERGE (d:Drug { name: row.name })
ON CREATE SET
d.primarySubstabce = row.primarySubstabce

WITH d, row

//Find the case to relate this drug based on the suspect type
MATCH (c:Case {primaryid: toInteger(row.primaryid)})

FOREACH (_ IN CASE WHEN row.role = "Primary Suspect" THEN [1] ELSE [] END |
//Relate
MERGE (c)-[relate:IS_PRIMARY_SUSPECT { drugSequence: row.drugSequence, route: row.route, doseAmount: row.doseAmount, doseUnit: row.doseUnit, indication: row.indication  }]-&gt;(d)
)

FOREACH (_ IN CASE WHEN row.role = "Secondary Suspect" THEN [1] ELSE [] END |
//Relate
MERGE (c)-[relate:IS_SECONDARY_SUSPECT { drugSequence: row.drugSequence, route: row.route, doseAmount: row.doseAmount, doseUnit: row.doseUnit, indication: row.indication  }]-&gt;(d)
)

FOREACH (_ IN CASE WHEN row.role = "Concomitant" THEN [1] ELSE [] END |
//Relate
MERGE (c)-[relate:IS_CONCOMITANT { drugSequence: row.drugSequence, route: row.route, doseAmount: row.doseAmount, doseUnit: row.doseUnit, indication: row.indication  }]-&gt;(d)
)

FOREACH (_ IN CASE WHEN row.role = "Interacting" THEN [1] ELSE [] END |
//Relate
MERGE (c)-[relate:IS_INTERACTING { drugSequence: row.drugSequence, route: row.route, doseAmount: row.doseAmount, doseUnit: row.doseUnit, indication: row.indication  }]-&gt;(d)
)
} IN TRANSACTIONS OF 5000 ROWS
;</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_load_therapies_and_link_them_with_cases_and_drugs"><a class="anchor" href="#_load_therapies_and_link_them_with_cases_and_drugs"></a>Load therapies and link them with cases and drugs</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">LOAD CSV WITH HEADERS FROM "https://raw.githubusercontent.com/neo4j-graph-examples/healthcare-analytics/main/data/csv/therapy.csv" AS row

//Conditionally create therapy node
MERGE (t:Therapy { primaryid: toInteger(row.primaryid) })

WITH t, row

//Find the case to relate this therapy to
MATCH (c:Case {primaryid: toInteger(row.primaryid)})

//Relate case with therapy
MERGE (c)-[:RECEIVED]-&gt;(t)

WITH c, t, row

//Find drugs prescribed in the therapy
MATCH (d:Drug { name: row.drugName })

//Relate therapy and drugs
MERGE (t)-[:PRESCRIBED { drugSequence: row.drugSequence, startYear: coalesce(row.startYear, 1900), endYear: coalesce(row.endYear, 2021) } ]-&gt;(d);</code></pre>
</div>
</div>
<div class="paragraph">
<p>We have loaded the data. Now we will be performing some analytics queries on the data.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_performing_data_analytics_side_effects"><a class="anchor" href="#_performing_data_analytics_side_effects"></a>Performing data analytics - Side Effects</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_what_are_the_top_5_side_effects_reported"><a class="anchor" href="#_what_are_the_top_5_side_effects_reported"></a>What are the top 5 side effects reported?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Case)-[:HAS_REACTION]-&gt;(r:Reaction)
RETURN r.description, count(c)
ORDER BY count(c) DESC
LIMIT 5;</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_what_are_the_top_5_drugs_reported_with_side_effects_get_drugs_along_with_their_side_effects"><a class="anchor" href="#_what_are_the_top_5_drugs_reported_with_side_effects_get_drugs_along_with_their_side_effects"></a>What are the top 5 drugs reported with side effects? Get drugs along with their side effects.</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Case)-[:IS_PRIMARY_SUSPECT]-&gt;(d:Drug)
MATCH (c)-[:HAS_REACTION]-&gt;(r:Reaction)
WITH d.name as drugName, collect(r.description) as sideEffects, count(r.description) as totalSideEffects
RETURN drugName, sideEffects[0..5] as sideEffects, totalSideEffects
ORDER BY totalSideEffects DESC LIMIT 5;</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_performing_data_analytics_companies"><a class="anchor" href="#_performing_data_analytics_companies"></a>Performing data analytics - Companies</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_what_are_the_manufacturing_companies_which_have_most_drugs_which_reported_side_effects"><a class="anchor" href="#_what_are_the_manufacturing_companies_which_have_most_drugs_which_reported_side_effects"></a>What are the manufacturing companies which have most drugs which reported side effects?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Manufacturer)-[:REGISTERED]-&gt;(c)-[:HAS_REACTION]-&gt;(r)
RETURN m.manufacturerName as company, count(distinct r) as numberOfSideEffects
ORDER BY numberOfSideEffects DESC LIMIT 5;</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_top_5_registered_drugs_and_their_side_effects"><a class="anchor" href="#_top_5_registered_drugs_and_their_side_effects"></a>Top 5 registered Drugs and their Side Effects</h3>
<div class="ulist">
<ul>
<li>
<p>What are the top 5 drugs from a particular company with side effects?</p>
</li>
<li>
<p>What are the side effects from those drugs?</p>
</li>
</ul>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Manufacturer {manufacturerName: 'NOVARTIS'})-[:REGISTERED]-&gt;(c)
MATCH (r:Reaction)&lt;--(c)-[:IS_PRIMARY_SUSPECT]-&gt;(d)
WITH d.name as drug,collect(distinct r.description) AS reactions, count(distinct r) as totalReactions
RETURN drug, reactions[0..5] as sideEffects, totalReactions
ORDER BY totalReactions DESC
LIMIT 5;</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_performing_data_analytics_consumer_reports"><a class="anchor" href="#_performing_data_analytics_consumer_reports"></a>Performing data analytics - Consumer Reports</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_what_are_the_top_5_drugs_which_are_reported_directly_by_consumers_for_the_side_effects"><a class="anchor" href="#_what_are_the_top_5_drugs_which_are_reported_directly_by_consumers_for_the_side_effects"></a>What are the top 5 drugs which are reported directly by consumers for the side effects?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Case)-[:REPORTED_BY]-&gt;(rpsr:ReportSource {name: "Consumer"})
MATCH (c)-[:IS_PRIMARY_SUSPECT]-&gt;(d)
MATCH (c)-[:HAS_REACTION]-&gt;(r)
WITH rpsr.name as reporter, d.name as drug, collect(distinct r.description) as sideEffects, count(distinct r) as total
RETURN drug, reporter, sideEffects[0..5] as sideEffects
ORDER BY total desc LIMIT 5;</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_what_are_the_top_5_drugs_whose_side_effects_resulted_in_death_of_patients_as_an_outcome"><a class="anchor" href="#_what_are_the_top_5_drugs_whose_side_effects_resulted_in_death_of_patients_as_an_outcome"></a>What are the top 5 drugs whose side effects resulted in Death of patients as an outcome?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Case)-[:RESULTED_IN]-&gt;(o:Outcome {outcome:"Death"})
MATCH (c)-[:IS_PRIMARY_SUSPECT]-&gt;(d)
MATCH (c)-[:HAS_REACTION]-&gt;(r)
WITH d.name as drug, collect(distinct r.description) as sideEffects, o.outcome as outcome, count(distinct c) as cases
RETURN drug, sideEffects[0..5] as sideEffects, outcome, cases
ORDER BY cases DESC
LIMIT 5;</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_performing_data_analytics_drug_combination_and_case_details"><a class="anchor" href="#_performing_data_analytics_drug_combination_and_case_details"></a>Performing data analytics - Drug Combination and Case Details</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_show_top_10_drug_combinations_which_have_most_side_effects_when_consumed_together"><a class="anchor" href="#_show_top_10_drug_combinations_which_have_most_side_effects_when_consumed_together"></a>Show top 10 drug combinations which have most side effects when consumed together</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Case)-[:IS_PRIMARY_SUSPECT]-&gt;(d1)
MATCH (c:Case)-[:IS_SECONDARY_SUSPECT]-&gt;(d2)
MATCH (c)-[:HAS_REACTION]-&gt;(r)
MATCH (c)-[:RESULTED_IN]-&gt;(o)
WHERE d1&lt;&gt;d2
WITH d1.name as primaryDrug, d2.name as secondaryDrug,
collect(r.description) as sideEffects, count(r.description) as totalSideEffects, collect(o.outcome) as outcomes
RETURN primaryDrug, secondaryDrug, sideEffects[0..3] as sideEffects, totalSideEffects, outcomes[0] ORDER BY totalSideEffects desc
LIMIT 10;</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_take_one_of_the_case_and_list_demographics_all_the_drugs_given_side_effects_and_outcome_for_the_patient"><a class="anchor" href="#_take_one_of_the_case_and_list_demographics_all_the_drugs_given_side_effects_and_outcome_for_the_patient"></a>Take one of the case, and list demographics, all the drugs given, side effects and outcome for the patient.</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Case {primaryid: 111791005})
MATCH (c)-[consumed]-&gt;(drug:Drug)
MATCH (c)-[:RESULTED_IN]-&gt;(outcome)
MATCH (c)-[:HAS_REACTION]-&gt;(reaction)
MATCH (therapy)-[prescribed:PRESCRIBED]-(drug)
WITH distinct c.age + ' ' + c.ageUnit as age, c.gender as gender,
collect(distinct reaction.description) as sideEffects,
collect(
    distinct {   drug: drug.name,
        dose: consumed.doseAmount + ' '  + consumed.doseUnit,
        indication: consumed.indication,
        route: consumed.route
    }) as treatment,
collect(distinct outcome.outcome) as outcomes
RETURN age, gender, treatment, sideEffects, outcomes ;</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_perform_some_more_statistical_analysis_age_groups"><a class="anchor" href="#_perform_some_more_statistical_analysis_age_groups"></a>Perform some more statistical analysis - Age Groups</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_what_is_the_age_group_which_reported_highest_side_effects_and_what_are_those_side_effects"><a class="anchor" href="#_what_is_the_age_group_which_reported_highest_side_effects_and_what_are_those_side_effects"></a>What is the age group which reported highest side effects, and what are those side effects?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:AgeGroup)&lt;-[:FALLS_UNDER]-(c:Case)
MATCH (c)-[:HAS_REACTION]-&gt;(r)
WITH a, collect(r.description) as sideEffects, count(r) as total
RETURN a.ageGroup as ageGroupName, sideEffects[0..6] as sideEffects
ORDER BY total DESC
LIMIT 1;</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_what_are_the_highest_side_effects_reported_in_children_and_what_are_the_drugs_those_caused_these_side_effects"><a class="anchor" href="#_what_are_the_highest_side_effects_reported_in_children_and_what_are_the_drugs_those_caused_these_side_effects"></a>What are the highest side effects reported in Children and what are the drugs those caused these side effects?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:AgeGroup {ageGroup:"Child"})&lt;-[:FALLS_UNDER]-(c)
MATCH (c)-[:HAS_REACTION]-&gt;(r)
MATCH (c)-[:IS_PRIMARY_SUSPECT]-&gt;(d)
WITH distinct r.description as sideEffect, collect(distinct d.name) as drugs, count(r) as sideEffectCount
RETURN sideEffect, drugs
ORDER BY sideEffectCount desc LIMIT 5;</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_what_is_the_percentage_wise_allocation_of_side_effects_for_each_age_group"><a class="anchor" href="#_what_is_the_percentage_wise_allocation_of_side_effects_for_each_age_group"></a>What is the percentage wise allocation of side effects for each age group?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Case)-[:HAS_REACTION]-&gt;(r)
WITH count(r) as totalReactions
MATCH (a:AgeGroup)&lt;-[:FALLS_UNDER]-(c)-[:HAS_REACTION]-&gt;(r)
WITH a, count(r) as ageGroupWiseReactions, totalReactions
RETURN a.ageGroup as ageGroupName, (ageGroupWiseReactions*100.00)/totalReactions as perc
ORDER BY perc DESC</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_next_steps"><a class="anchor" href="#_next_steps"></a>Next steps</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_references"><a class="anchor" href="#_references"></a>References</h3>
<div class="ulist">
<ul>
<li>
<p><a href="https://neo4j.com/use-cases/life-sciences/" target="_blank" rel="noopener">Neo4j Life Sciences Use-Cases</a></p>
</li>
<li>
<p><a href="https://neo4j.com/developer/life-sciences-and-healthcare/" target="_blank" rel="noopener">Neo4j Healthcare Projects</a></p>
</li>
<li>
<p><a href="https://en.wikipedia.org/wiki/Health_care_analytics" target="_blank" rel="noopener">Healthcare Analytics</a></p>
</li>
<li>
<p><a href="https://en.wikipedia.org/wiki/FDA_Adverse_Event_Reporting_System" target="_blank" rel="noopener">FDA Adverse Event Reporting System Wiki</a></p>
</li>
<li>
<p><a href="https://fis.fda.gov/extensions/FPD-QDE-FAERS/FPD-QDE-FAERS.html" target="_blank" rel="noopener">FAERS Datasets</a></p>
</li>
<li>
<p><a href="https://neo4j.com/video/lifesciences-workshop2021/" target="_blank" rel="noopener">Neo4j Life Sciences Workshop</a></p>
</li>
</ul>
</div>
</div>
<div class="sect2">
<h3 id="_full_source_code_available_on_github"><a class="anchor" href="#_full_source_code_available_on_github"></a>Full Source Code Available on GitHub</h3>
<div class="ulist">
<ul>
<li>
<p><a href="https://github.com/neo4j-graph-examples/healthcare-analytics" target="_blank" rel="noopener">Source Code with Cypher and data dumps</a></p>
</li>
</ul>
</div>
</div>
</div>
</div>
</article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">

  <div class="column logo">
    <div class="logo-footer"></div>
  </div>
  
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us →</a></h2>
    <ul>
      <li>US: 1-855-636-4532</li>
      <li>Sweden +46 171 480 113</li>
      <li>UK: +44 20 3868 3223</li>
      <li>France: +33 (0) 1 88 46 13 20</li>
    </ul>
  </div>

    <div class="column">
    <p>© <span id="footer-copyright-year">2024</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup>®</sup>, Neo Technology<sup>®</sup>, Cypher<sup>®</sup>, Neo4j<sup>®</sup> Bloom<sup>™</sup> and
      Neo4j<sup>®</sup> Aura<sup>™</sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  
</div>
</footer>

  <script src="../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../assets/js/site.js"></script>
  <script async src="../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../assets/js/vendor/image-zoom.js"></script>


<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
